Revit 2027 API
BuiltInFailures.RegenFailures.ForceRegenSketch Property
 Regen Sketch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ForceRegenSketch { get; }
Public Shared ReadOnly Property ForceRegenSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ForceRegenSketch {
	FailureDefinitionId^ get ();
}
static member ForceRegenSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace